In [1]:
from pandas import DataFrame

In [2]:
data={"name":["ram","kukku","tom"],
     "age":["56","22","25"],
     "salary":["10000","25000","30000"]}

In [3]:
frame=DataFrame(data)

In [4]:
frame

    name age salary
0    ram  56  10000
1  kukku  22  25000
2    tom  25  30000

In [5]:
new_frame=DataFrame(data,columns=['name',"salary","age"])

In [6]:
new_frame

    name salary age
0    ram  10000  56
1  kukku  25000  22
2    tom  30000  25

In [7]:
new_frame=DataFrame(data,columns=['name',"salary","age","place"])

In [8]:
new_frame

    name salary age place
0    ram  10000  56   NaN
1  kukku  25000  22   NaN
2    tom  30000  25   NaN

In [9]:
new_frame['age']

0    56
1    22
2    25
Name: age, dtype: object

In [12]:
new_frame.loc[2]

name        tom
salary    30000
age          25
place       NaN
Name: 2, dtype: object

In [13]:
new_frame['place']='kochi'
new_frame

    name salary age  place
0    ram  10000  56  kochi
1  kukku  25000  22  kochi
2    tom  30000  25  kochi

In [14]:
new_frame['edu']='BTech'
new_frame

    name salary age  place    edu
0    ram  10000  56  kochi  BTech
1  kukku  25000  22  kochi  BTech
2    tom  30000  25  kochi  BTech

In [15]:
new_frame.T

            0      1      2
name      ram  kukku    tom
salary  10000  25000  30000
age        56     22     25
place   kochi  kochi  kochi
edu     BTech  BTech  BTech